emacs/org-mode/multiple-files/bash.md

# Table of Contents

1.  [Bash Reference Manual](#org301e746)
    1.  [Introduction](#orga1ab8b3)
        1.  [What is Bash?](#org4d07aad)
        2.  [What is a shell?](#orgc69149d)
    2.  [Definitions](#orgcd31d1c)


<a id="org301e746"></a>

# Bash Reference Manual

This text is a brief description of the features that are present in the Bash shell (version 5.2, 19 September 2022). The Bash home page is <http://www.gnu.org/software/bash/>.

This is Edition 5.2, last updated 19 September 2022, of The GNU Bash Reference Manual, for Bash, Version 5.2.


<a id="orga1ab8b3"></a>

## Introduction


<a id="org4d07aad"></a>

### What is Bash?

Bash is the shell, or command language interpreter, for the GNU operating system. The name is an acronym for the ‘Bourne-Again SHell’, a pun on Stephen Bourne, the author of the direct ancestor of the current Unix shell sh, which appeared in the Seventh Edition Bell Labs Research version of Unix.


<a id="orgc69149d"></a>

### What is a shell?

At its base, a shell is simply a macro processor that executes commands. The term macro processor means functionality where text and symbols are expanded to create larger expressions.


<a id="orgcd31d1c"></a>

## Definitions

These definitions are used throughout the remainder of this manual.

POSIX

A family of open system standards based on Unix. Bash is primarily concerned with the Shell and Utilities portion of the POSIX 1003.1 standard.

blank
A space or tab character.

